#### DuplicateTypeNamesHandlerArgs Members

---

|  |
| --- |
| DuplicateTypeNamesHandlerArgs Class   Methods   Properties   See Also |

The  DuplicateTypeNamesHandlerArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DuplicateTypeNamesHandlerArgs |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetTypeIds | Returns ids of the types with duplicate names. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Document | The document that contains the types with duplicate names. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DuplicateTypeNamesHandlerArgs Class

Autodesk.Revit.DB Namespace